emacs/.emacs.d/configuration.org
#+title: Emacs Configuration
#+property: header-args :tangle init.el :exports code

* Preamble
There are a bunch of people I've shamelessly stolen from. The ideas and pieces
of code are scattered in this file with no direct citations. This isn't a paper.
Here's an incomplete list, in no particular order:

- [[https://github.com/hrs/dotfiles][Harry Schwartz]]. I've taken lots of stuff from him.
- [[https://so.nwalsh.com/2020/02/29/dot-emacs][Norman Walsh]]. I stole most of the startup tricks, tangling the files and many
  other things directly from him.
- [[https://robert.kra.hn/posts/2021-02-07_rust-with-emacs/][Robert Krahn]]. Rust specific setup.

I assume that =use-package= and =general= are always available and sprinkle their
incantations generously throughout the configuration.

* Early init file
Some settings to reduce startup time and possibly make Emacs flicker less when
reading the configuration files.

** Increase GC cap
#+begin_src emacs-lisp :tangle early-init.el
(setq gc-cons-threshold 100000000)
#+end_src

** Disable filename handlers

#+begin_src emacs-lisp :tangle early-init.el
(defvar file-name-handler-alist-original file-name-handler-alist)
(setq file-name-handler-alist nil)
#+end_src

** Disable GUI elements
#+begin_src emacs-lisp :tangle early-init.el
(push '(menu-bar-lines . 0) default-frame-alist)
(push '(tool-bar-lines . 0) default-frame-alist)
(push '(vertical-scroll-bars) default-frame-alist)
#+end_src

* Prelude
** Setup package
#+begin_src emacs-lisp
(require 'package)
(add-to-list 'package-archives '("gnu" . "https://elpa.gnu.org/packages/") t)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
(add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t)

;; Ensure that use-package is installed.
;;
;; If use-package isn't already installed, it's extremely likely that this is a
;; fresh installation! So we'll want to update the package repository and
;; install use-package before loading the literate configuration.
(when (not (package-installed-p 'use-package))
  (package-refresh-contents)
  (package-install 'use-package))

#+end_src

** Load fonts
#+begin_src emacs-lisp
(set-face-font 'default "Iosevka-11")
(set-face-font 'fixed-pitch "Iosevka-11")
#+end_src

** Constants
#+begin_src emacs-lisp
(defconst *sys/linux*
  (eq system-type 'gnu/linux))

(defconst *sys/windows*
  (eq system-type 'windows-nt))

(defconst *sys/mac*
  (eq system-type 'darwin))
#+end_src

** Functions
#+begin_src emacs-lisp
(defun hgf/emacs-path (filename)
  "Return the file path of FILENAME relative to the Emacs directory."
  (format "%s%s" user-emacs-directory filename))

(defun hgf/journal-path (filename)
  "Return the file path of FILENAME relative to the Journal directory."
  (format "%s%s" "~/cloud/journal/" filename))

(defun hgf/org-path (filename)
  "Return the file path of FILENAME relative to the Org directory."
  (format "%s%s" "~/cloud/org/" filename))

(defun hgf/find-file-as-sudo ()
  (interactive)
  (let ((file-name (buffer-file-name)))
    (when file-name
      (find-alternate-file (concat "/sudo::" file-name)))))
#+end_src

** Macros
#+begin_src emacs-lisp
(defmacro pipe (init &rest lst)
  "Pipe INIT through LST.

Evaluate transformation pipeline LST. Either append argument at
the end or replace all :arg occurences (starting with INIT).

Example:
(pipe (number-sequence 1 10)
      (-filter 'cl-evenp)
      (mapcar '1+))
=> (3 5 7 9 11)

(pipe (number-sequence 1 10)
    (-filter 'cl-evenp)
    (mapcar '1+)
    (-filter (lambda (x) (= 0 (mod x 3))))
    (mapcar '1+)
    (-filter (lambda (x) (= 0 (mod x 5)))))
=> (10)

(pipe 1
      (1+)
      (1+)
      ((lambda (x y) (+ y x)) :arg 100))
=> 103"
  (-reduce-from (lambda (acc el)
		  (if (member :arg el)
		      (-replace :arg acc el)
		    (append el `(,acc))))
		init
		lst))
#+end_src

* Configure Emacs defaults
All kinds of Emacs things that just don't sit right with me.

** Theme
#+begin_src emacs-lisp
(defun hgf/edit-weatherwax ()
  "Edit the Weatherwax theme."
  (interactive)
  (find-file (hgf/emacs-path "themes/weatherwax-theme.el")))

(defun hgf/disable-all-themes ()
  (dolist (theme custom-enabled-themes)
    (disable-theme theme)))

(defun hgf/load-theme (theme)
  "Disable all loaded themes and load THEME. Also sets certain face attributes I like to use."
  (interactive
   (list (intern (completing-read "Load custom theme: "
				  (mapcar 'symbol-name
					  (custom-available-themes))))))
  (unless (custom-theme-name-valid-p theme)
    (error "Invalid theme name `%s'" theme))
  (progn
    (hgf/disable-all-themes)
    (load-theme theme t)
    ))
#+end_src

#+begin_src emacs-lisp
(setq custom-theme-directory (hgf/emacs-path "themes/"))
#+end_src

** Garbage collection
Thanks, Norman Walsh!

#+begin_src emacs-lisp
(defvar hgf/gc-cons-threshold 67108864 ; 64mb
  "The default value to use for `gc-cons-threshold'.
If you experience freezing, decrease this. If you experience stuttering, increase this.")

(add-hook 'emacs-startup-hook
	  (lambda ()
	    (setq gc-cons-threshold hgf/gc-cons-threshold)
	    (setq file-name-handler-alist file-name-handler-alist-original)
	    (makunbound 'file-name-handler-alist-original)))
#+end_src

** Personal information
Letting Emacs know who I am.

#+begin_src emacs-lisp
(setq user-full-name "Hristo Filaretov"
      user-mail-address "h.filaretov@campus.tu-berlin.de")
#+end_src

** Load path
#+begin_src emacs-lisp
(add-to-list 'load-path (hgf/emacs-path "lisp"))
#+end_src

** Custom file
#+begin_src emacs-lisp
(setq custom-file (hgf/emacs-path "custom.el"))
(load custom-file 'noerror)
#+end_src


** Global auto-revert
On the rare occasions when something changes outside of Emacs, I'd
like Emacs to revert the buffer to the state on disk.

#+begin_src emacs-lisp
(global-auto-revert-mode +1)
#+end_src

** Show parens
#+begin_src emacs-lisp
(show-paren-mode 1)
#+end_src

** Immediately show parens
#+begin_src emacs-lisp
(setq show-paren-delay 0.0)
#+end_src

** Don't automatically add newlines at the end of files
#+begin_src emacs-lisp
(setq require-final-newline t)
#+end_src

** Quick y/n prompts
#+begin_src emacs-lisp
(defalias 'yes-or-no-p 'y-or-n-p)
#+end_src

** Make scripts executable
#+begin_src emacs-lisp
(add-hook 'after-save-hook
	  'executable-make-buffer-file-executable-if-script-p)
#+end_src

** Bar as cursor
#+begin_src emacs-lisp
(setq-default cursor-type 'bar)
#+end_src

** No blinking cursor
#+begin_src emacs-lisp
(blink-cursor-mode 0)
#+end_src

** Ignore the mouse cursor position
#+begin_src emacs-lisp
(setq mouse-yank-at-point t)
#+end_src

** Follow symlinks
Visit real files when looking at symlink under version control.

#+begin_src emacs-lisp
(setq vc-follow-symlinks t)
#+end_src

** Sentences don't end with two spaces
#+begin_src emacs-lisp
(setq sentence-end-double-space nil)
#+end_src

** Ask me before closing Emacs
For the occasional annoying typo.

#+begin_src emacs-lisp
(setq confirm-kill-emacs 'y-or-n-p)
#+end_src

** No bell
#+begin_src emacs-lisp
(setq ring-bell-function 'ignore)
#+end_src

** Startup screen
#+begin_src emacs-lisp
(setq inhibit-startup-screen t
      inhibit-startup-message t
      initial-scratch-message nil)
#+end_src

** Backups
#+begin_src emacs-lisp
(setq backup-inhibited t
      auto-save-default nil
      make-backup-files nil)
#+end_src

** Scrolling
#+begin_src emacs-lisp
(setq scroll-margin 0
      scroll-step 1
      scroll-conservatively 10000
      scroll-preserve-screen-position 1)
#+end_src

** Modeline
I like a less cluttered modeline.

#+begin_src emacs-lisp
(defun hgf/modeline-modified ()
  "Return buffer status: read-only (-), modified (·) or read-write ( )."
  (let ((read-only buffer-read-only)
	(modified  (and buffer-file-name (buffer-modified-p))))
    (cond
     (modified (propertize " ∙ " 'face 'bold))
     (read-only " - ")
     (t "   "))))

(setq-default
 mode-line-format
 '(
   ""
   (:eval (hgf/modeline-modified))
   ;; Buffer name
   "%b"
   "  "
   ;; VC Branch
   (:eval (when-let (vc vc-mode)
	    (propertize (substring vc 5)
			'background nil)))))
#+end_src

* Configuring packages - =use-package=
I use =use-package= for packaging packages I use.

** Add package archives
Since we're using good ole =package= as a package manager, we have to add some
package archives.

#+begin_src emacs-lisp
(require 'package)
(add-to-list 'package-archives '("gnu" . "https://elpa.gnu.org/packages/") t)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
(add-to-list 'package-archives '("org" . "http://orgmode.org/elpa/") t)
#+end_src

** Ensure =use-package= is available
If it's a fresh installation, =use-package= might not be installed.

#+begin_src emacs-lisp
(when (not (package-installed-p 'use-package))
  (package-refresh-contents)
  (package-install 'use-package))
#+end_src

** Configure =use-package=
#+begin_src emacs-lisp
(use-package use-package
  :config
  (setq use-package-always-ensure t))
#+end_src

* Keybindings - =general.el=
I use =general= for my keybindings. It's generally quite good. The keybindings
themselves will be found throughout this file.

#+begin_src emacs-lisp
(use-package general
  :config
  (general-evil-setup)
  (global-set-key [remap dabbrev-expand] 'hippie-expand))
#+end_src

I like using space as a leader key. C-c followed by a single letter is also used
often enough to warrant a definer.

#+begin_src emacs-lisp
(general-create-definer hgf/leader-def
  :prefix "C-c")
#+end_src

And finally, set a few keybindings I want to have throughout Emacs.

#+begin_src emacs-lisp
(general-def "M-i" 'imenu)
#+end_src

And now for something completely different

#+begin_src emacs-lisp
(general-def "M-n" 'scroll-up-command)
(general-def "M-p" 'scroll-down-command)
#+end_src

* Building up a stdlib

#+begin_src emacs-lisp
(use-package s)
(use-package dash)
#+end_src

* Theme
#+begin_src emacs-lisp
(use-package gruvbox-theme)
(hgf/load-theme 'gruvbox-dark-medium)
#+end_src

