emacs/.emacs.d/init.el

(with-eval-after-load 'ox-latex
  (add-to-list 'org-latex-classes
	       '("book"
		 "\\documentclass{book}\n[NO-DEFAULT-PACKAGES]\n[EXTRA]\n"
		 ("\\chapter{%s}" . "\\chapter*{%s}")
		 ("\\section{%s}" . "\\section*{%s}")
		 ("\\subsection{%s}" . "\\subsection*{%s}")
		 ("\\subsubsection{%s}" . "\\subsubsection*{%s}")))
  (add-to-list 'org-latex-classes
	       '("ieee"
		 "\\documentclass{IEEEtran}\n[NO-DEFAULT-PACKAGES]\n[EXTRA]\n"
		 ("\\section{%s}" . "")
		 ("\\subsection{%s}" . "")
		 ("\\subsubsection{%s}" . "")))
  (add-to-list 'org-latex-classes
	       '("blank"
		 ""
		 ("\\section{%s}" . "")
		 ("\\subsection{%s}" . "")
		 ("\\subsubsection{%s}" . ""))))
(use-package ox-extra
  :ensure org-plus-contrib
  :commands ox-extras-activate
  :config
  (ox-extras-activate '(ignore-headlines)))

(use-package org-ql
  :config
  (general-unbind org-ql-view-map "C-x C-s"))
(use-package org-super-agenda
  :config
  (setq org-super-agenda-header-map nil))
(use-package ts)

(defun hgf/org-ql-effort-on (&optional date type)
  "Return the amount of estimated effort on a date.

If DATE is nil, 'today' is used.
TYPE may be 'scheduled' or 'closed'. If nil, it is set to 'total'."
  (let ((date (or date 'today))
	(type (or type 'scheduled)))
    (thread-last (org-ql-query
		   :from (org-agenda-files)
		   :where `(and (,type :on ,date) (property "EFFORT"))
		   :select '(org-entry-get (org-get-at-bol) "EFFORT"))
      (-map #'org-duration-to-minutes)
      (-reduce #'+)
      (org-duration-from-minutes))))

(defun hgf/org-super-group-append-efforts-to-item (it)
  (let* ((name (plist-get it :name))
	 (date (cadr (text-properties-at 0 name))))
    (plist-put it :name 
	       (s-concat name " [" (hgf/org-ql-effort-on date) "]"))))

(defun hgf/org-super-weekly-agenda ()
  (interactive)
  (org-ql-search
    (org-agenda-files)
    '(scheduled :from today :to 7)
    :sort '(date priority todo)
    :super-groups '((:auto-ts t :transformer hgf/org-super-group-append-efforts-to-item))))

(require 'reftex-parse)
(require 'bibtex)
(use-package tex
  :ensure auctex
  :mode ("\\.tex\\'" . tex-mode)
  :config
  (general-def tex-mode-map
    "C-M-g" 'hgf/pdf-view-first-page-other-window
    "C-M-n" 'hgf/pdf-view-next-page-other-window
    "C-M-p" 'hgf/pdf-view-previous-page-other-window)
  (setq TeX-auto-save t)
  (setq TeX-parse-self t)
  (setq TeX-master nil)
  (setq TeX-PDF-mode t)
  (add-hook 'TeX-after-compilation-finished-functions #'TeX-revert-document-buffer))

(use-package auctex-latexmk
  :after tex
  :config
  (auctex-latexmk-setup)
  (setq auctex-latexmk-inherit-TeX-PDF-mode t))

(with-eval-after-load 'bibtex
(defun hgf/bibtex-complete ()
  (interactive)
  (let ((bib-files (reftex-locate-bibliography-files "."))
	entries)
    (dolist (file bib-files)
      (message "Completing: %s" file)
      (with-temp-buffer
	(insert-file-contents file)
	(bibtex-mode)
	(setq entries (-concat (bibtex-parse-keys nil t) entries))))
    (insert (completing-read "cite: " (-map #'car entries))))))
      
(general-def "C-c [" 'hgf/bibtex-complete)

(defun hgf/bibtex-hook ()
  "My bibtex hook."
  (progn
    (setq comment-start "%")))

(add-hook 'bibtex-mode-hook 'hgf/bibtex-hook)

(setq-default TeX-auto-save t
	      TeX-parse-self t
	      TeX-PDF-mode t
	      TeX-auto-local (hgf/emacs-path "auctex-auto"))
(setq bibtex-dialect 'biblatex)

(use-package markdown-mode
  :mode (("README\\.md\\'" . markdown-mode)
	 ("\\.md\\'" . markdown-mode)
	 ("\\.markdown\\'" . markdown-mode)))

(use-package ledger-mode
  :mode ("\\.ledger\\'")
  :config
  (add-to-list 'ledger-reports '("diet" "%(binary) -f %(ledger-file) reg --value Assets --budget --daily"))
  (add-to-list 'ledger-reports '("work" "%(binary) -f %(ledger-file) bal --add-budget")))

(use-package vterm
  :general ("<f4>" 'vterm)
  :config
  (setq vterm-shell "/usr/bin/fish"
	vterm-kill-buffer-on-exit t
	vterm-copy-exclude-prompt t))

(defun hgf/named-term (term-name)
  "Generate a terminal with buffer name TERM-NAME."
  (interactive "sTerminal purpose: ")
  (vterm (concat "term-" term-name)))

(hgf/leader-def "t" 'hgf/named-term)

(use-package which-key
  :config
  (which-key-mode))

(use-package visual-fill-column
  :defer t
  :config
  (setq-default visual-fill-column-width 90))

(use-package outshine
  :hook (prog-mode . outshine-mode)
  :config
  (setq outshine-startup-folded-p t))

(use-package engine-mode
  :defer 2
  :config
  (engine-mode 1)
  (defengine wikipedia
    "http://www.wikipedia.org/search-redirect.php?language=en&go=Go&search=%s"
    :keybinding "w"
    :docstring "Searchin' the wikis."))

(use-package magit
  :commands (magit-status magit-list-repositories)
  :config
  (advice-add 'magit-list-repositories :before #'hgf/repolist-refresh))

(defun hgf/contains-git-repo-p (dir)
  "Check if there's  a .git directory in DIR."
  (let ((dirs (directory-files dir)))
    (member ".git" dirs)))

(defun file-directory-real-p (dir)
  (and (file-directory-p dir)
       (not (equal (substring dir -1) "."))))

(defun hgf/find-git-repos-recursive (basedir)
  "Return a list of directories containing a .git directory."
  (let ((result))
    (dolist (f (-filter 'file-directory-real-p (directory-files basedir t)) result)
      (if (hgf/contains-git-repo-p f)
	  (add-to-list 'result f)
	(setq result (append result (hgf/find-git-repos-recursive f)))))
    result))

(defun hgf/make-magit-repolist (dirs)
  "Make a list of the form (dir 0) for the magit-list-repositories function from DIRS."
  (let ((result))
    (dolist (dir dirs result)
      (add-to-list 'result `(,dir 0)))
    result))

(defun hgf/repolist-refresh ()
  "Hi."
  (setq magit-repository-directories
	(pipe "~/dev"
	      (hgf/find-git-repos-recursive)
	      (hgf/make-magit-repolist))))


(setq magit-repolist-columns
      '(("Name" 12 magit-repolist-column-ident nil)
	("Branch" 10 magit-repolist-column-branch nil)
	("B<U" 3 magit-repolist-column-unpulled-from-upstream
	 ((:right-align t)
	  (:help-echo "Upstream changes not in branch")))
	("B>U" 3 magit-repolist-column-unpushed-to-upstream
	 ((:right-align t)
	  (:help-echo "Local changes not in upstream")))
	("Version" 30 magit-repolist-column-version nil)
	("Path" 99 magit-repolist-column-path nil)))

(use-package treemacs
  :general ("C-c T" 'treemacs)
  :config
  (setq treemacs-no-png-images t
	treemacs-width 24))

(defun hgf/title-case-filename (filename)
  (thread-last filename
    (file-name-sans-extension)
    (s-replace "_" " ")
    (upcase-initials)))

(defun hgf/treemacs-file-name-org-title (filename)
  (pcase (file-name-extension filename)
    ("org" (hgf/title-case-filename filename))
    (otherwise filename)))

(setq treemacs-file-name-transformer 'hgf/treemacs-file-name-org-title)

(use-package project
  :ensure nil
  :config
  (general-def
    "C-x p f" 'project-find-file
    "C-x p p" 'project-select-project))

(defun project--build-project-list ()
  "Create a list of all git repos."
  (hgf/find-git-repos-recursive "~/dev"))

(setq display-buffer-alist
      '((".*" (display-buffer-reuse-window display-buffer-same-window))))

(setq display-buffer-reuse-frames t
      even-window-sizes nil)
