emacs/.emacs.d/configuration.org
* Yasnippet

#+begin_src emacs-lisp
(use-package yasnippet
  :commands yas-minor-mode
  :init
  (setq yas-indent-line 'fixed)
  (add-hook 'org-mode-hook 'yas-minor-mode)
  :config
  (yas-reload-all))

(use-package yasnippet-snippets
  :after yasnippet)
#+end_src


* Helpful

#+begin_src emacs-lisp
(use-package helpful
  :defer t
  :config
  (hgf/leader-def
    "h h" 'helpful-at-point)
  (general-def
    "C-h h" 'helpful-at-point
    "C-h k" 'helpful-key
    "C-h F" 'helpful-function
    "C-h C" 'helpful-command
    "C-c C-d" 'helpful-at-point))
#+end_src

* Hydra
I'm not really using Hydra properly, except for the window management
stuff that I seldom need to use.

#+begin_src emacs-lisp
(use-package hydra
  :defer t
  :config
  (defhydra hydra-org-mode (:exit t)
    "Org mode"
    ("c" org-capture "capture")
    ("i" org-capture-inbox "inbox")
    ("t" org-todo-list "todos")
    ("a" org-agenda "agenda"))
  (defhydra hydra-window ()
    "Window management"
    ("o" other-window "other")
    ("h" evil-window-left "left")
    ("j" evil-window-down "down")
    ("k" evil-window-up "up")
    ("l" evil-window-right "right")
    ("s" evil-window-split "split")
    ("v" evil-window-vsplit "vsplit")
    ("q" evil-quit "quit")
    ("f" find-file "file")
    ("m" kill-this-buffer "murder")
    ("1" delete-other-windows "highlander")
    ("." nil "stop"))
  (defhydra hydra-files (:exit t)
    "Frequent files"
    ;; Configuration
    ("c" (hydra-configs/body) "configs")
    ("e" (find-file (hgf/emacs-path "configuration.org")) "config")
    ;; Org
    ("b" (find-file (hgf/journal-path "blog.org")) "blog")
    ("d" (find-file (hgf/journal-path "diet/diet.ledger")) "diet")
    ("D" (find-file (hgf/journal-path "diet/food.ledger")) "food")
    ("m" (find-file (hgf/journal-path "calendar.org")) "calendar")
    ("i" (find-file (hgf/journal-path "inbox.org")) "inbox")
    ("n" (find-file (hgf/journal-path "notes.org")) "notes")
    ("p" (find-file (hgf/journal-path "projects.org")) "projects")
    ("w" (find-file (hgf/journal-path "wiki.org")) "wiki")
    ;; Work
    ("f" (hydra-work/body) "fraunhofer")
    ;; Scratch
    ("s" (hgf/make-scratch-buffer) "scratch"))
  (defhydra hydra-configs (:exit t)
    "Configuration files"
    ("i" (find-file "~/.config/i3/config") "i3")
    ("g" (find-file "~/.config/git") "git")
    ("k" (find-file "~/.config/kitty/kitty.conf") "kitty")
    ("r" (find-file "~/.config/ranger/rc.conf") "ranger")
    ("R" (find-file "~/.config/rofi/config") "Rofi")
    ("e" (find-file (hgf/emacs-path "configuration.org")) "emacs")
    ("f" (find-file "~/.config/fish/config.fish") "fish"))
  (defhydra hydra-work (:exit t)
    "Work related files"
    ("n" (find-file (hgf/journal-path "fraunhofer/notes.org")) "notes")
    ("t" (find-file (hgf/journal-path "fraunhofer/working_hours.ledger")) "working hours"))
  (defhydra hydra-package (:exit t)
    "Package management"
    ("r" (package-refresh-contents) "refresh")
    ("i" (call-interactively #'package-install) "install")
    ("u" (package-utils-upgrade-all) "upgrade")
    ("d" (call-interactively #'package-delete) "delete"))
  (hgf/leader-def
    "P" 'hydra-package/body
    "f" 'hydra-files/body
    "w" 'hydra-window/body
    "o" 'hydra-org-mode/body))
#+end_src

* PDF Tools
Editing PDFs has never been easier.

#+begin_src emacs-lisp
(defun hgf/pdf-view-next-page-other-window ()
  (interactive)
  (with-selected-window (get-buffer-window (find-buffer-visiting (concat (cdr (project-current)) "build/main.pdf")))
    (pdf-view-next-page)))

(defun hgf/pdf-view-previous-page-other-window ()
  (interactive)
  (with-selected-window (get-buffer-window (find-buffer-visiting (concat (cdr (project-current)) "build/main.pdf")))
    (pdf-view-previous-page)))

(defun hgf/pdf-view-first-page-other-window ()
  (interactive)
  (with-selected-window (get-buffer-window (find-buffer-visiting (concat (cdr (project-current)) "build/main.pdf")))
    (pdf-view-first-page)))
#+end_src

#+begin_src emacs-lisp
(use-package pdf-tools
  :defer 2
  :config
  (add-to-list 'global-auto-revert-ignore-modes 'pdf-view-mode))
#+end_src

* Triage

#+begin_src emacs-lisp
(defun hgf/switch-to-previous-buffer ()
  "Switch to previously open buffer.
      Repeated invocations toggle between the two most recently open buffers."
  (interactive)
  (switch-to-buffer (other-buffer (current-buffer) 1)))

(defun visiting-file-p ()
  "Check whether current buffer is visiting an existing file."
  (let ((filename (buffer-file-name)))
    (and filename (file-exists-p filename))))

(defun hgf/delete-this-file ()
  "Remove file connected to current buffer and kill buffer."
  (interactive)
  (let ((filename (buffer-file-name))
	(buffer (current-buffer))
	(name (buffer-name)))
    (if (not (visiting-file-p))
	(kill-buffer buffer)
      (when (yes-or-no-p "Delete this file? ")
	(delete-file filename)
	(kill-buffer buffer)
	(message "File %s successfully removed" filename)))))

(defun hgf/rename-this-file ()
  "Rename current buffer and associated file."
  (interactive)
  (let ((name (buffer-name))
	(filename (buffer-file-name)))
    (if (not (visiting-file-p))
	(error "Buffer '%s' is not visiting a file!" name)
      (let ((new-name (read-file-name "New name: " filename)))
	(if (get-buffer new-name)
	    (error "A buffer named '%s' already exists!" new-name)
	  (rename-file filename new-name 1)
	  (rename-buffer new-name)
	  (set-visited-file-name new-name)
	  (set-buffer-modified-p nil)
	  (message "File '%s' successfully renamed to '%s'"
		   name (file-name-nondirectory new-name)))))))

(defun hgf/get-org-title ()
  "Get the raw string of the current buffer's #+TITLE property."
  (substring-no-properties
   (car (plist-get (org-export-get-environment) :title))))

(defun hgf/org-export-file-to-file (infile outfile backend)
  (write-region (org-export-string-as
		 (with-temp-buffer
		   (insert-file-contents infile)
		   (buffer-string))
		 backend)
		nil
		outfile))

(defun hgf/make-scratch-directory ()
  "Create a temporary scratch directory."
  (interactive)
  (find-file (make-temp-file "scratch-" t)))

(defun hgf/make-scratch-buffer ()
  "Create and switch to a temporary scratch buffer with a random
name."
  (interactive)
  (switch-to-buffer (make-temp-name "scratch-")))
#+end_src


* Text mode
I like auto-filling, 80 columns and spell-checking, thank you very much.
#+begin_src emacs-lisp
(use-package text-mode
  :ensure nil
  :config
  (setq-default fill-column 80)
  (add-hook 'text-mode-hook 'auto-fill-mode))
#+end_src

#+begin_src emacs-lisp
(use-package flyspell
  :hook (text-mode . flyspell-mode)
  :ensure nil
  :config
  (setq ispell-program-name "aspell"
	ispell-extra-args '("--sug-mode=ultra")))

#+end_src
